Enums/УсловияРаботыСЧЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УсловияРаботыСЧЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПокупаетТоварыЧЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыЧЗВРозницу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаДляСобственныхНужд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеКлассифицирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчастникОборота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговляСНовымиРегионами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/УсловияРаботыСЧЗ/Ext/ManagerModule.bsl
Функция УсловиеВыгрузкиЧЗВЭДО(Условие) Экспорт
//+Белов А. 03.03.2026 #UT10-5730

	МассивПроверки = Новый Массив;
	МассивПроверки.Добавить(Перечисления.УсловияРаботыСЧЗ.УчастникОборота);
	МассивПроверки.Добавить(Перечисления.УсловияРаботыСЧЗ.ПокупкаДляСобственныхНужд);
	
	//+Белов А. 04.03.2026 #Бизнес решил и для этих условий тоже выгружать в эдо

	МассивПроверки.Добавить(Перечисления.УсловияРаботыСЧЗ.НеКлассифицирован);
	МассивПроверки.Добавить(Перечисления.УсловияРаботыСЧЗ.ТоварыЧЗВРозницу);
	МассивПроверки.Добавить(Перечисления.УсловияРаботыСЧЗ.ПустаяСсылка());
	//-Белов А. 04.03.2026 # 
	
	//+Белов А. 07.05.2026 #UT10-5843
	МассивПроверки.Добавить(Перечисления.УсловияРаботыСЧЗ.ТорговляСНовымиРегионами);	
	//-Белов А. 07.05.2026 #UT10-5843
	
	Если МассивПроверки.Найти(Условие) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;         
	
	Возврат Ложь;
	
//-Белов А. 03.03.2026 #UT10-5730	
КонецФункции

Функция НужноУбиратьКодыМаркировкиПоДоговоруДляСамовывоза(Договор) Экспорт  
	
	Если Договор.Организация = Константы.ОсновнаяОрганизация.Получить() И
		(Договор.УсловияРаботыСЧЗ = Перечисления.УсловияРаботыСЧЗ.ПокупкаДляСобственныхНужд
		ИЛИ Договор.РозничнаяПродажа) Тогда
		Возврат Ложь;	
	КонецЕсли;         
	
	Возврат Истина;
			
КонецФункции
